---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutRoofError
source: html/890bb15a-c034-d790-3ab5-ca8d3c92653b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutRoofError Property

The roof couldn't be cut.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutRoofError { get; }
```